In [1]:
import pandas as pd

In [2]:
import pandas as pd

data = {
    'employee_id': [2, 3, 7, 8, 9],
    'name': ['Meir', 'Michael', 'Addilyn', 'Juan', 'Kannon'],
    'salary': [3000, 3800, 7400, 6100, 7700]
}

employees = pd.DataFrame(data)
display(employees)

   employee_id     name  salary
0            2     Meir    3000
1            3  Michael    3800
2            7  Addilyn    7400
3            8     Juan    6100
4            9   Kannon    7700

In [40]:
# method 1
result = []
for index, row in employees.iterrows():
    if row["employee_id"]%2 != 0 and row["name"][0] != "M":
        result.append([row["employee_id"], row["salary"]])
    else:
        result.append([row["employee_id"], 0])
result = pd.DataFrame(result)
result.columns = ["employee_id", "bonus"]
result_df = result.sort_values(by="employee_id", ascending=True)
display(result_df)

   employee_id  bonus
0            2      0
1            3      0
2            7   7400
3            8      0
4            9   7700

In [41]:
# method 2
mask = ((employees["employee_id"]%2 != 0) & (employees["name"].str[0] != "M"))
result_df = pd.DataFrame({
    "employee_id": employees["employee_id"],
    "bonus": employees["salary"].where(mask==True, 0)
})
result_df.sort_values(by="employee_id", ascending=True)
result_df

   employee_id  bonus
0            2      0
1            3      0
2            7   7400
3            8      0
4            9   7700